---
kind: method
id: M:Autodesk.Revit.DB.Structure.FabricSheet.GetWireCenterlines
source: html/244edf4d-88ee-40af-9d19-aac1d6708844.htm
---
# Autodesk.Revit.DB.Structure.FabricSheet.GetWireCenterlines Method

Gets a list of curves representing the wires centerlines of the Fabric Sheet in the both distribution directions.

## Syntax (C#)
```csharp
public IList<Curve> GetWireCenterlines()
```

## Returns
The centerline curves.